# places_data.py

# places_data.py

PLACES = {
    # ПАРКИ
    "🌳 Президентский парк": {
        "img": "images/president.JPG",
        "text": "🌳 **Президентский парк**\n\nОгромный парк в форме птицы Самрук. Идеально для прогулок!\n\n📍 Жми на кнопку ниже, чтобы построить маршрут:",
        "2gis": "https://2gis.kz/astana/geo/70000001019586873/71.458259,51.123964"
    },
    "🚶‍♂️Линейный парк": {
        "img": "images/linear.JPG",
        "text": "🌿 **Линейный парк**\n\nУютная аллея между «Абу-Даби Плаза» и Ботаническим садом.\n📍 Расположен на левом берегу.",
        "2gis": "https://2gis.kz/astana/geo/70030076167435995/71.426710,51.118651"
    },
    "🌿 Ботанический сад": {
        "img": "images/botanic.Jpg",
        "text": "🌿 **Ботанический сад**\n\nСовременный сад с беговыми и велодорожками. Есть большая оранжерея.\n📍 Расположен на левом берегу.",
        "2gis": "https://2gis.kz/astana/geo/70000001061880425/71.418533,51.108840"
    },
    "🌊 Набережная Есиль": {
        "img": "images/esil.JPG",
        "text": "🌊 **Набережная Есиль**\n\nСамое популярное место для прогулок с видом на реку.",
        "2gis": "https://2gis.kz/astana/geo/9570836402930141/71.424095,51.160490"
    },


    # КАФЕ И РЕСТОРАНЫ (Добавляй сюда свои места)
    "Sandyq 🥘": {
        "img": "images/Sandyq.JPG",
        "text": "🥘 **Sandyq**\n\nРесторан аутентичной казахской кухни. Отличное место, чтобы прочувствовать колорит!",
        "2gis": "https://2gis.kz/astana/geo/70000001086860585"
    },
    "Rafe ☕": {
        "img": "images/Rafe.JPG",
        "text": "☕ **Rafe**\n\nУютная кофейня с отличным кофе и десертами.",
        "2gis": "https://2gis.kz/astana/search/Rafe"
    },
    "Selfie 🥂":{
        "img": "images/Selfie.JPG",
        "text":"Премиум-ресторан с панорамным видом на высоте 18-го этажа.",
        "2gis": "https://2gis.kz/astana/geo/70000001028338057"
    },
    "Crepe Cafe 🥞":{
        "img": "images/Crepe.JPG",
        "text": "Стильное место, где готовят лучшие блины и завтраки.",
        "2gis": "https://2gis.kz/astana/geo/70000001032988559"
    },
    # ДОСТОПРИМЕЧАТЕЛЬНОСТИ
    "Байтерек 🗼": {
        "img": "images/Baiterek.JPG",
        "text": "🗼 **Монумент Байтерек**\n\nГлавный символ столицы. На высоте птичьего полета открывается панорамный вид на город.",
        "2gis": "https://2gis.kz/astana/geo/70000001050092012/71.424113,51.090871"
    },
    "Сфера «Нур Алем» 🔮": {
        "img": "images/Nur.JPG",
        "text": "Музей будущего с технологичными экспонатами на 8 этажах.",
        "2gis": "https://2gis.kz/astana/geo/9570784863354303/71.416157,51.089277"
    },
    "Пирамида 📐": {
        "img": "images/piramida.JPG",
        "text": "Уникальное здание, символ мира и согласия всех религий.",
        "2gis": "https://2gis.kz/astana/geo/70000001018089575/71.463494,51.123156"
    },
    "Мечеть Хазрет Султан 🕌": {
        "img": "images/sultan.JPG",
        "text": "Величественный храм с белоснежной архитектурой.",
        "2gis": "https://2gis.kz/astana/geo/70000001018105093/71.472917,51.126119"
    },
    # Шопинг и кино
    "Хан Шатыр 🎪":{
        "img": "images/Xan.JPG",
        "text": "ТРЦ в виде гигантского шатра с пляжем наверху.",
        "2gis": "https://2gis.kz/astana/geo/70000001018125368"
    },
    "Mega Silk Way 🛍️":{
        "img": "images/Mega.JPG",
        "text": "Самый большой и светлый молл для шопинга в городе.",
        "2gis": "https://2gis.kz/astana/geo/70000001026995330/71.405441,51.089347"
    },"Abu Dhabi Plaza 🏢":{
        "img": "images/Abu_Dabi.JPG",
        "text": "Высочайшее здание в Центральной Азии с ТРЦ внутри.",
        "2gis": "https://2gis.kz/astana/geo/70000001040015055/71.427811,51.121806"
    },"Kinopark / Chaplin":{
        "img": "images/Kinopark.JPG",
        "text": "Современные кинотеатры с форматами IMAX и Dolby.",
        "2gis": "https://2gis.kz/astana/search/Chaplin"
    },
    #🎭 Культура и искусство
    "Астана Опера 🎻":{
        "img": "images/Opera.JPG",
        "text": "Театр мирового уровня с роскошным интерьером.",
        "2gis": "https://2gis.kz/astana/geo/70000001018117572/71.410430,51.134915"
    },"Национальный музей 🏺":{
        "img": "images/Muz.JPG",
        "text": "Главное хранилище истории и «Золотого человека».",
        "2gis": "https://2gis.kz/astana/geo/70000001018608940/71.469471,51.118023"
    },"Ailand 🐠":{
        "img": "images/Ailand.JPG",
        "text": "Единственный в городе океанариум и крытый аквапарк.",
        "2gis": "https://2gis.kz/astana/geo/70000001018081165"
    },"Астана Балет 🩰":{
        "img": "images/Balet.JPG",
        "text": "Современный театр с упором на балетное искусство.",
        "2gis": "https://2gis.kz/astana/geo/70000001027094683"
    },
    #Развлечения
    "Каток «Алау» ⛸️":{
        "img": "images/Alau.JPG",
        "text": "Профессиональный ледовый дворец для массовых катаний.",
        "2gis": "https://2gis.kz/astana/geo/70000001018102444"
    },
    "Квест-румы 🗝️":{
        "img": "images/Qwest.JPG",
        "text": "Групповые игры на логику и поиск выхода из комнат.",
        "2gis": "https://2gis.kz/astana/search/quest"},
    "Караоке 🎤":{
        "img": "images/Karaoke.JPG",
        "text": "Просторные кабинки для пения с топовым звуком.",
        "2gis": "https://2gis.kz/astana/search/Караоке"},

}